Revit 2027 API
ParameterTypeId.ColumnBaseAttachmentOffsetParam Property
 "Offset From Attachment At Base"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColumnBaseAttachmentOffsetParam { get; }
Public Shared ReadOnly Property ColumnBaseAttachmentOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColumnBaseAttachmentOffsetParam {
	ForgeTypeId^ get ();
}
static member ColumnBaseAttachmentOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace